Revit 2027 API
BuiltInFailures.MEPCalculationFailures.ExtraPumpSet Property
 More than one parallel pump set defined for the same loop. Verify the flow distribution and delete the extra set, if desired.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtraPumpSet { get; }
Public Shared ReadOnly Property ExtraPumpSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtraPumpSet {
	FailureDefinitionId^ get ();
}
static member ExtraPumpSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace